#!/usr/bin/env python3
import os
os.system("sudo apt install hash-identifier")
os.system("clear")

print(""" ____  _   _   ____  ____   ___   ____ ____      _    __  __ 
| __ )| | | | |  _ \|  _ \ / _ \ / ___|  _ \    / \  |  \/  |
|  _ \| | | | | |_) | |_) | | | | |  _| |_) |  / _ \ | |\/| |
| |_) | |_| | |  __/|  _ <| |_| | |_| |  _ <  / ___ \| |  | |
|____/ \___/  |_|   |_| \_\\___/ \____|_| \_\/_/   \_\_|  |_|
                                                             
 _  __    _    _     ___ _____ ____  ___ _  __
| |/ /   / \  | |   |_ _|_   _|  _ \|_ _| |/ /
| ' /   / _ \ | |    | |  | | | |_) || || ' / 
| . \  / ___ \| |___ | |  | | |  _ < | || . \ 
|_|\_\/_/   \_\_____|___| |_| |_| \_\___|_|\_\
                                              
 _____  _    ____      _    _____ ___ _   _ ____    _    _   _ 
|_   _|/ \  |  _ \    / \  |  ___|_ _| \ | |  _ \  / \  | \ | |
  | | / _ \ | |_) |  / _ \ | |_   | ||  \| | | | |/ _ \ |  \| |
  | |/ ___ \|  _ <  / ___ \|  _|  | || |\  | |_| / ___ \| |\  |
  |_/_/   \_\_| \_\/_/   \_\_|   |___|_| \_|____/_/   \_\_| \_|
                                                               
__   __ _     ________ _     __  __ ___ ____ _____ ___ ____  
\ \ / // \   |__  /_ _| |   |  \/  |_ _/ ___|_   _|_ _|  _ \ 
 \ V // _ \    / / | || |   | |\/| || |\___ \ | |  | || |_) |
  | |/ ___ \  / /_ | || |___| |  | || | ___) || |  | ||  _ < 
  |_/_/   \_\/____|___|_____|_|  |_|___|____/ |_| |___|_| \_\





""")


print("""
 _   _           _       ____        _ 
| | | | __ _ ___| |__   | __ ) _   _| |
| |_| |/ _` / __| '_ \  |  _ \| | | | |
|  _  | (_| \__ \ | | | | |_) | |_| | |
|_| |_|\__,_|___/_| |_| |____/ \__,_|_|

BU PROGRAM KALİTRİK TARAFINDAN YAZILMIŞTIR!
""")



print("""Lütfen Aşağıya Kırmak İstediğiniz Hashi Yazınız:

Size Hangi Türle Şifrelendiğini Söyleyecektir!""")
print("""
Yazınızı yazdıktan sonra 
 
Possible Heals çıkacak 1.seçenek yüksek ihtimalle doğrudur.

""")
 
kod = input("Kırılacak Hashi Yazınız (Çıkış Ctrl+C)=")
 

os.system("hash-identifier "+ kod)
kod = input("Lütfen Hangi Yolla Şifrelendiğini Girin=")

















